function drink_info_tc() //gml_Script_drink_info_tc
{
    if (current_scene == 0)
    {
        list_drink_material = ["牛奶", "咖啡", "糖漿"]
        drink_menu = ["和諧之杯", "濃郁意式咖啡", "牛奶", "天鵝絨意式咖啡", "甜醇咖啡", "蜜糖輕風", "雲朵舒適", "糖漿絲滑", "奶油瀑布", "甜美精華"]
        drink_descrip = ["咖啡、牛奶與甜味的完美平衡混合，\n調和所有風味。", "純淨、濃郁的意式咖啡射擊，為喜歡\n咖啡原味的人準備。", "只是熱牛奶", "順滑綿密，這款飲品結合了咖啡的濃\n郁深度與牛奶的天鵝絨般的質地。", "帶有一絲甜味的濃郁咖啡，適合\n溫和提神的體驗。", "輕微含咖啡因且味道甜美，適合\n喜歡柔和咖啡觸感的人。", "舒適的奶油味熱飲，帶有甜美的\n收尾，適合放鬆時刻。", "加倍糖漿的絲滑牛奶，提供奢華的甜味。", "奶油的豐富牛奶在濃郁的咖啡基底上\n流淌，創造出豐富、順滑的質感。", "強烈的僅糖漿混合物，為喜歡純甜味\n的人準備。"]
    }
    else if (current_scene == 1)
    {
        list_drink_material = ["烈酒", "果汁", "利口酒"]
        drink_menu = ["斷路器", "Bad Touch", "賽博迷霧", "光子爆破", "Piano Man", "Moonblast", "鉻夜", "電子嗡嗡", "數據流", "神經同步"]
        drink_descrip = ["一種打破感官的飲品，提供對抗\n數字霸主的味道。", "Alma 想要一個……呃……一個 Bad Touch。", "神秘且難以捉摸的雞尾酒，其銀色\n本質喚起未來的霧茫茫。", "一款尖銳且清新的雞尾酒，帶有似乎\n帶電的發光質量。", "一個奇怪的飲料。嗯……促銷飲料\n輕鬆符合這個要求。", "來點小的、甜的、冰涼的東西。", "為城市夜行者設計的涼爽且光滑的飲\n品，反射月光下城市的金屬光澤。", "一種強效的刺激飲品，為夜間的黑客\n活動和探險提供能量。", "象徵網絡領域信息無休止流動的順滑\n且流暢的雞尾酒。", "一種純淨未稀釋的霓虹酒精，為希望\n直接連接到霓虹網格的人準備。"]
    }
    else if (current_scene == 2)
    {
        list_drink_material = ["綠茶", "茉莉", "枸杞"]
        drink_menu = ["翠玉清風", "茉莉初露", "仙露瓊漿", "三花聚頂", "龍眼佳人", "瓊漿玉露", "紅顏舊", "宮廷秘飲", "花好月圓", "君子蘭"]
        drink_descrip = ["純粹的綠茶享受，清新且使人焕发青春，\n古代學者和詩人的最愛。", "以綠茶為基底，微妙的茉莉芬芳，清新\n優雅，帶有溫柔的花香。", "結合枸杞和綠茶新鮮香氣的滋養混合物，\n提供健康與活力。", "三種成分的完美和諧，象徵風味的\n平衡與統一。", "以濃郁的茉莉香氣為主，綠茶為基礎，\n恍如古代美女彈奏古琴的觸感。", "芳香的茉莉與甜美的枸杞相結合，\n彷佛漫步在天堂的花園。", "以枸杞的健康效益為中心，補充綠茶\n的清新，一款長壽飲品。", "營養的枸杞與芳香的茉莉混合，\n曾是皇室的首選飲料。", "純茉莉花茶，花香濃郁且令人舒適，\n以其寧靜的特質和愉悅的香氣而聞名。", "專為飲用枸杞精釀，象徵學者的高貴與長壽。"]
    }
    else if (current_scene == 3)
    {
        list_drink_material = ["威士忌", "蘭姆酒", "苦艾酒"]
        drink_menu = ["羅伯特·羅伊", "生銹的釘子", "完美曼哈頓", "古巴老人", "黑暴風", "纜車", "邁泰", "內格羅尼", "老廣場", "種植者的衝擊"]
        drink_descrip = ["基於蘇格蘭威士忌的經典雞尾酒，\n簡單卻優雅。", "將威士忌和朗姆酒混合，結合甜味\n與力量。", "曼哈頓雞尾酒的變種，平衡苦艾酒\n與威士忌。", "混合經典的古巴風味與威士忌和\n苦艾酒。", "朗姆酒的深邃迷人風味。", "靈感來自舊金山的纜車，結合朗姆酒\n和威士忌。", "經典的熱帶風味雞尾酒，美妙地混合\n了朗姆酒和苦艾酒。", "經典的意大利雞尾酒，以苦艾酒為主，\n味道甘苦。", "來自新奧爾良的經典雞尾酒，複雜且\n深邃。", "傳統的加勒比雞尾酒，以其大膽的風味\n和濃郁的口感而聞名。"]
    }
    else if (current_scene == 4)
    {
        list_drink_material = ["草藥", "漿果", "葡萄酒"]
        drink_menu = ["草藥師之釀", "漿果木甘露", "僧侶珍藏", "釀酒師的漿果草稿", "男爵混合", "漿果狂歡", "古韻天鵝絨", "園丁混合", "藥劑師的靈藥", "豐收佳釀"]
        drink_descrip = ["由三種精選草藥精製而成，這款補品因其\n藥用和振奮精神的品質而備受推崇。", "一種茂盛的，清爽的混合飲料，結合了成熟\n的漿果和一點草藥精華，喚起了森林的新鮮感。", "神聖的配方將草藥的神聖與修道院陳年葡萄酒\n的豐富相結合。", "一種活力十足的飲品，在漿果的多汁口感\n與精緻的葡萄酒之間取得了完美平衡。", "一種高貴的混合飲品，帶有葡萄酒的濃郁\n和漿果的清香，適合貴族享用。", "一種漿果的純粹慶典，這款飲料是一\n場自然甜味的狂歡。", "一種精心挑選的年份混合，旨在提供\n豐富層次感和奢華口感。", "一種質樸的，令人愉悅的混合飲料，\n捕捉了精心打理的花園和優質葡萄酒\n的精華。", "一種強效的混合飲品，以其助消化和\n舒緩特性而聞名，靈感來自傳統的藥劑配方。", "擁抱豐收的果實，這種混合飲品展示了\n成熟漿果的完整風味，並帶有葡萄酒的餘韻。"]
    }
    else if (current_scene == 5)
    {
        list_drink_material = ["電解質水", "蛋白濃縮液", "維生素果凍"]
        drink_menu = ["電解光波", "蛋白脈衝", "微重力震盪", "維生素幻彩", "能量晶體", "多光譜果凍", "抗輻射飲料", "感應果凍", "生物回饋液", "太空甜點"]
        drink_descrip = ["這款飲料使用了一種特殊的電解質\n平衡配方，在光照下能夠發光，\n增強夜間活動的安全性。", "利用納米技術使蛋白質在體內迅速\n吸收，適合高強度太空任務後快\n速補充能量。", "加入了微納米氣泡，能在微重力\n環境中產生有趣的震盪效果，提供\n獨特的飲用體驗。", "這款飲料含有可根據酸鹼度變化\n顏色的維生素果凍，讓宇航員可以\n視覺上監控維生素攝入。", "特殊的蛋白質結晶形態可以緩慢\n溶解，持續釋放能量和營養，適合\n長時間任務。", "每種顏色的果凍代表不同的營養\n譜，宇航員可以根據需要選擇顏色\n，直觀了解所需營養。", "加入特殊的抗輻射成分，幫助宇\n航員減少太空中的輻射傷害，同時\n提供力量增強。", "這款飲料可以根據宇航員的身體\n狀態自動調節甜度和口感，最優化\n地補充能量和營養。", "含有生物回饋感應器，能實時監\n測並調整飲品中的營養成分，以適\n應宇航員的具體需求。", "設計模仿地球上的甜點，提供熟\n悉的味道和舒適感，同時富含營養。"]
    }
    else if (current_scene == 6)
    {
        list_drink_material = ["維度精華", "心靈之光", "懷舊汽水"]
        drink_menu = ["維度之門", "心靈封印", "夢境穿梭", "超感探測", "時光倒流", "復古泡泡", "心靈觸感", "時空裂隙", "暗影回響", "記憶覺醒"]
        drink_descrip = ["由三重維度精華調製而成，探索未知維度的\n神秘力量。", "強化心靈防禦，抵禦外部精神干擾，同時帶來\n令人懷念的風味。", "結合維度精華的神秘與心靈之光的感知，彷彿\n自由穿梭於夢境與現實之間。", "以懷舊汽水為基底，輔以維度精華，增強對\n超自然現象的感知能力。", "細膩的心靈之光與復古汽水交織，讓人回到\n美好的過去，重溫舊日時光。", "充滿 1980 年代風格的汽水，帶來清爽而懷舊\n的味道。", "純由心靈之光調製，可提升精神感知，\n使飲者能夠察覺周圍的情緒與思維。", "融合三種材料，創造出一款能夠撕裂時空的\n神秘飲品。", "兩份懷舊汽水與一份維度精華的混合，\n入口後可感受到來自異次元的回響。", "兩份維度精華與心靈之光的強大結合，\n喚醒深層記憶與潛藏能力。"]
    }
}

