function drink_info_ko() //gml_Script_drink_info_ko
{
    if (current_scene == 0)
    {
        list_drink_material = ["우유", "커피", "시럽"]
        drink_menu = ["하모니 컵", "에스프레소 인텐소", "우유", "벨벳 에스프레소", "둘체 브루", "허니드 라이트", "클라우디 컴포트", "시럽드 실크", "크림 캐스케이드", "스위트 에센스"]
        drink_descrip = ["커피, 우유 및 약간의 단맛이 조화를 이루는 완벽하게 균형 잡힌 블렌드입니다.", "커피의 타협하지 않는 맛을 즐기는 이들을 위한 순수하고 강한 에스프레소 샷.", "그냥 뜨거운 우유", "커피의 풍부한 깊이와 우유의 벨벳 같은 질감이 결합된 부드럽고 크리미한 음료.", "약간의 단맛으로 부드러워진 대담한 커피로, 부드럽게 기분을 전환하는 데 이상적입니다.", "부드러운 커피 감촉을 즐기는 이들을 위해 가볍게 카페인이 첨가되고 달콤하게 향이 첨가된 음료.", "달콤한 마무리와 함께 포근하고 크리미한 우유 음료로 편안한 순간에 이상적입니다.", "럭셔리한 단맛을 위해 두 배의 시럽으로 풍부하게 만든 실키 스무스 우유.", "풍부한 커피 위에 크리미한 우유가 흘러내리며 럭셔리하고 부드러운 질감을 만들어냅니다.", "순수하게 단맛만을 즐기는 이들을 위한 강렬한 시럽만의 조합입니다."]
    }
    else if (current_scene == 1)
    {
        list_drink_material = ["스피릿", "주스", "리큐어"]
        drink_menu = ["서킷 브레이커", "Bad Touch", "사이버 미스트", "포톤 블라스트", "Piano Man", "Moonblast", "크롬 나이트", "일렉트로 버즈", "데이터 스트림", "뉴럴 싱크"]
        drink_descrip = ["감각을 방해하는 음료로, 디지털 오버로드에 대한 반란의 맛을 제공합니다.", "Alma가… 푸흣… Bad Touch를 원해.", "미래의 안개 같은 불확실성을 불러일으키는 신비롭고 수수께끼 같은 칵테일.", "에너지로 충전된 것처럼 보이는 빛나는 품질의 날카롭고 상쾌한 칵테일.", "이상한 음료. 음… 프로모션 음료가 딱 맞겠어.", "작고 달콤하고 차가운 거.", "달빛 아래 도시의 금속적 광택을 반영하는 도시 야행성 동물을 위한 시원하고 세련된 음료.", "해킹과 탐험의 밤을 위해 에너지를 주는 강력한 킥의 음료.", "사이버 영역에서 끊임없이 흐르는 정보를 상징하는 매끄럽고 흐르는 칵테일.", "네온 그리드에 직접 연결하려는 이들을 위한 순수하고 희석되지 않은 네온 리큐어 샷."]
    }
    else if (current_scene == 2)
    {
        list_drink_material = ["녹차", "자스민", "구지"]
        drink_menu = ["제이드 브리즈", "자스민 돈", "불사의 엘릭서", "트리니티 블로섬", "드래곤 메이든", "로열 넥타", "뷰티 레민턴", "임페리얼 시크릿", "문리트 블로섬스", "스칼라 오르키드"]
        drink_descrip = ["순수한 녹차의 즐거움, 상쾌하고 회춘하는, 고대 학자와 시인들 사이에서 인기가 있습니다.", "자스민 향이 첨가된 녹차의 베이스, 신선하고 우아하며 부드러운 꽃향기가 나는 차.", "구지 베리와 녹차의 신선한 향이 결합된 영양가 있는 조합으로 건강과 활력을 제공합니다.", "세 가지 재료의 완벽한 조화로 맛의 균형과 통일을 상징합니다.", "고대 미인이 구쟁을 연주하는 것처럼 지속되는 주로 자스민 향이 나는 녹차.", "향기로운 자스민과 달콤한 구지 베리가 서로를 강화하며, 천상의 정원을 거닐듯한 경험을 선사합니다.", "구지 베리의 건강 효능에 중점을 두고 녹차의 신선함과 결합된 음료로 장수를 위한 음료입니다.", "영양가 있는 구지와 향기로운 자스민이 결합된 음료로, 한때 왕실에서 선호하는 음료였습니다.", "강렬한 꽃향기와 진정 효과가 있는 순수한 자스민 차로, 평온한 특성과 즐거운 향기로 유명합니다.", "학자의 귀족성과 장수를 상징하는 구지 베리만으로 우려낸 차."]
    }
    else if (current_scene == 3)
    {
        list_drink_material = ["위스키", "럼", "베르무트"]
        drink_menu = ["롭 로이", "러스티 네일", "퍼펙트 맨해튼", "올드 큐반", "다크 앤 스토미", "케이블 카", "마이 타이", "네그로니", "뷰 카레", "플랜터스 펀치"]
        drink_descrip = ["스카치 위스키를 기반으로 한 클래식 칵테일, 간단하면서도 우아합니다.", "달콤함과 힘을 결합한 위스키와 럼의 혼합.", "베르무트와 위스키의 균형을 맞춘 맨해튼 칵테일의 변형.", "위스키와 베르무트를 결합한 클래식한 쿠바 맛.", "깊고 매혹적인 럼의 힘.", "샌프란시스코의 케이블카에서 영감을 받아 럼과 위스키를 결합한 음료.", "럼과 베르무트를 멋지게 혼합한 클래식한 트로피칼 플레이버.", "베르무트가 지배적인 클래식 이탈리아 칵테일, 쓰고 달콤합니다.", "뉴올리언스의 클래식 칵테일, 복잡하고 깊은 맛.", "대담한 맛과 강한 맛으로 알려진 전통적인 카리브해 칵테일."]
    }
    else if (current_scene == 4)
    {
        list_drink_material = ["허브", "베리", "와인"]
        drink_menu = ["허브티스트의 양조주", "베리우드 넥타", "수도사의 비축주", "와인 제조사의 베리 초안", "남작의 블렌드", "베리 주빌리", "빈티지 벨벳", "정원의 블렌드", "약사의 엘릭서", "풍요로운 수확"]
        drink_descrip = ["정교한 허브 세 가지로 제조된 이 토닉은 약효와 활력 증진 효과로 유명합니다.", "잘 익은 베리와 허브 에센스의 조화를 이루어 숲의 신선함을 불러일으키는 풍부하고 상쾌한 블렌드입니다.", "허브의 신성함과 수도원에서 숙성된 와인의 풍미가 결합된 신성한 레시피입니다.", "베리의 풍부한 즙과 고급 와인의 세련됨이 만나 활기찬 혼합주입니다.", "와인의 강렬함과 베리의 향이 어우러진 귀족을 위한 고귀한 믹스입니다.", "베리의 순수한 축제로, 이 음료는 자연의 단맛을 담은 축제입니다.", "선택된 빈티지의 정교한 블렌드로, 풍부하고 호화로운 맛을 선사합니다.", "잘 관리된 정원과 고급 와인의 본질을 담아낸 소박하고 매력적인 블렌드입니다.", "전통 약국 레시피에서 영감을 받은 소화와 진정 효과로 유명한 강력한 혼합주입니다.", "풍요로운 수확을 기리며, 잘 익은 베리의 풍미를 와인 마무리와 함께 선보입니다."]
    }
    else if (current_scene == 5)
    {
        list_drink_material = ["전해질 물", "단백질 농축액", "비타민 젤리"]
        drink_menu = ["전해질 광택", "단백질 펄스", "미세중력 진동", "비타민 크로마틱스", "에너지 크리스탈", "멀티스펙트럼 젤리", "방사선 방어", "감응 젤리", "바이오피드백 유체", "우주 디저트"]
        drink_descrip = ["이 음료는 빛 아래에서 빛나는 특별한 전해질 균형 공식을 사용하여, 야간 활동의 안전성을 향상시킵니다.", "나노기술을 사용하여 몸속에서 단백질이 빠르게 흡수되도록 하여, 고강도 우주 임무 후 빠른 에너지 회복에 이상적입니다.", "미세 나노버블이 주입되어 미세중력 환경에서 흥미로운 진동 효과를 만들어내며, 독특한 음료 경험을 제공합니다.", "pH 수준에 따라 색상이 변하는 비타민 젤리를 포함하고 있어, 우주인이 비타민 섭취를 시각적으로 모니터링할 수 있습니다.", "특별한 결정형 단백질이 천천히 용해되어 에너지와 영양분을 지속적으로 방출하며, 장기간 임무에 적합합니다.", "젤리의 각 색상은 다른 영양 스펙트럼을 나타내어, 우주인이 필요에 따라 색상을 선택하고 필요한 영양을 직관적으로 이해할 수 있습니다.", "특별한 방사선 방어 구성 요소를 포함하여 우주에서의 방사선 피해를 줄이고 힘을 증가시킵니다.", "이 음료는 우주인의 신체 상태에 따라 단맛과 질감을 자동으로 조절하며, 에너지와 영양을 최적으로 보충합니다.", "바이오피드백 센서를 포함하고 있어 실시간으로 영양 성분을 모니터링 및 조정하여 우주인의 구체적인 요구에 맞춥니다.", "지구의 디저트와 비슷하게 디자인되어, 친숙한 맛과 편안함을 제공하면서 영양이 풍부합니다."]
    }
    else if (current_scene == 6)
    {
        list_drink_material = ["차원의 정수", "마음의 빛", "향수 소다"]
        drink_menu = ["차원의 관문", "정신 봉인", "꿈의 횡단", "초감각 탐지", "시간 흐름 되감기", "레트로 버블", "텔레파시 접촉", "시공간 균열", "그림자의 메아리", "기억의 각성"]
        drink_descrip = ["세 배의 차원의 정수를 혼합하여 다른 차원의 미지의 힘과 신비를 탐구하는 강력한 음료.", "외부 정신 간섭으로부터 마음을 보호하면서도 향수를 불러일으키는 맛을 제공합니다.", "차원의 정수의 신비와 마음의 빛의 감각을 결합하여 꿈과 현실을 자유롭게 넘나드는 느낌을 줍니다.", "향수 소다를 기본으로 하여 차원의 정수를 추가해 초자연적 현상을 감지할 수 있도록 강화합니다.", "마음의 빛과 레트로 소다의 섬세한 조화로 과거의 좋은 날들로 돌아가 추억을 되살립니다.", "1980년대의 느낌을 가득 담은 이 소다는 상쾌하고 향수를 불러일으키는 맛을 제공합니다.", "오직 마음의 빛으로만 이루어진 이 음료는 정신 능력을 강화하여 주변의 감정과 생각을 감지할 수 있도록 합니다.", "세 가지 재료를 융합하여 시간과 공간에 균열을 일으킬 수 있는 신비한 음료를 만듭니다.", "향수 소다 두 부분과 차원의 정수 한 부분을 혼합하여, 마시는 순간 다른 차원의 메아리가 들려옵니다.", "차원의 정수 두 부분과 마음의 빛이 강력하게 조화되어 깊이 잠재된 기억과 능력을 깨웁니다."]
    }
}

