function drink_info_jap() //gml_Script_drink_info_jap
{
    if (current_scene == 0)
    {
        list_drink_material = ["ミルク", "コーヒー", "シロップ"]
        drink_menu = ["ハーモニーカップ", "エスプレッソ\nインテンソ", "ミルク", "ベルベット\nエスプレッソ", "ドゥルセ\nブリュー", "ハニード\nライト", "クラウディ\nコンフォート", "シロップド\nシルク", "クリーム\nカスケード", "スウィート\nエッセンス"]
        drink_descrip = ["コーヒー、ミルク、甘さのバラ\nンスが取れた完璧なブレンドで、\n全ての味が調和しています。", "純粋で強烈なエスプレッソのシ\nョット。コーヒーの真髄を味わ\nいたい方に。", "ただの温かいミルク", "コーヒーの豊かな味わいとミルクのベルベ\nットのような滑らかさが組み合わさった、\n滑らかでクリーミーなドリンク。", "少しの甘さでやわらげた力強いコーヒー。\n優しく元気づける体験に最適。", "軽くカフェインが効いて甘く風味付けされ\nた、ソフトなコーヒーを楽しむ人にぴっ\nたりのドリンク。", "甘いフィニッシュの心地よいクリーミ\nーなミルクドリンク。リラックスし\nた瞬間に理想的。", "二重のシロップで豊かにされたシル\nクのように滑らかなミルク。", "豊かなコーヒーの基盤にクリーミーなミ\nルクが流れるカスケード。豊かで滑らかな質感\nを生み出します。", "純粋なシロップだけの強烈な調合。甘い\nエッセンスを味わいたい人向け。"]
    }
    else if (current_scene == 1)
    {
        list_drink_material = ["スピリット", "ジュース", "リキュール"]
        drink_menu = ["サーキット\nブレーカー", "Bad Touch", "サイバー・ミスト", "フォトン・ブラスト", "Piano Man", "Moonblast", "クローム・ナイト", "エレクトロ・バズ", "データ・ストリーム", "ニューラル・シンク"]
        drink_descrip = ["感覚を破壊するドリンク。デジタルの\n支配者に対する反乱の味。", "Alma は…ぷっ…Bad Touch が欲しい。", "神秘的で謎めいたカクテル。未来の不確か\nな霧を銀色のエッセンスで表現。", "エネルギーを帯びたような輝く品質が特徴\nの、鋭く爽やかなカクテル。", "奇妙な飲み物。うーん…プロモの\n飲み物がピッタリだ。", "小さくて甘くて冷たいものがいい。", "都市の夜のクローラー向けのクールでスタイリ\nッシュなドリンク。月光の下で都市の金属的\nな光沢を反映。", "ハッキングと探索の夜に向けて活力を与\nえるポテントキックを持つドリンク。", "サイバー領域での情報の絶え間ない流れを\n象徴する滑らかで流れるようなカクテル。", "ネオングリッドに直接接続することを\n求める人々のための、純粋で薄められていな\nいネオンリキュールのショット。"]
    }
    else if (current_scene == 2)
    {
        list_drink_material = ["緑茶", "ジャスミン", "ゴジベリー"]
        drink_menu = ["ジェイド・ブリーズ", "ジャスミン・ドーン", "不老不死のエリクサー", "トリニティ\nブロッサム", "ドラゴン・メイデン", "ロイヤル・ネクター", "ビューティー\nレムナント", "インペリアル\nシークレット", "ムーンリット\nブロッサムズ", "スカラーズ\nオーキッド"]
        drink_descrip = ["純粋な緑茶を楽しむ、リフレッシュで若返\nりの効果がある、古代の学者や詩人\nに愛されています。", "ジャスミンの香りがほんのりと効いた緑茶\nのベース、新鮮でエレガント、穏\nやかな花の香り。", "ゴジベリーと新鮮な緑茶の香りを組\nみ合わせた栄養豊富な飲み物で、\n健康と活力を提供します。", "三つの成分が完璧に調和した、バラン\nスと一体感の象徴。", "主にジャスミンの香りで、緑茶の基盤が\nあり、古代美女が琴を奏でるタッ\nチのように留まります。", "香り高いジャスミンと甘いゴジベリーを\n組み合わせ、まるで天国の庭\nを散歩するよう。", "ゴジベリーの健康効果を中心に、緑茶\nの新鮮さを加えた、長寿を促進\nする飲み物。", "栄養豊富なゴジと香り高いジャスミンをブ\nレンドした、かつて王族の選択だった飲み物。", "純粋なジャスミンティー、花の香りが強く、心地よい。\nその平和な特性と楽しい香りで知られています。", "ゴジベリーから特別に醸造され、学者の高貴\nさと長寿を象徴する飲み物。"]
    }
    else if (current_scene == 3)
    {
        list_drink_material = ["ウイスキー", "ラム", "ベルモット"]
        drink_menu = ["ロブ・ロイ", "ラスティ・ネイル", "パーフェクト\nマンハッタン", "オールド\nキューバン", "ダーク・アンド\nストーミー", "ケーブル・カー", "マイタイ", "ネグローニ", "ヴューキャレ", "プランターズ\nパンチ"]
        drink_descrip = ["スコッチウイスキーをベースにしたクラシック\nなカクテル、シンプルでエレガント。", "ウイスキーとラムをブレンドし、甘さと力強さ\nを組み合わせたカクテル。", "マンハッタンカクテルのバリエーション\nで、ウイスキーとベルモットのバランス\nが取れています。", "クラシックなキューバのフレーバーをウイスキーと\nベルモットで混ぜ合わせたカクテル。", "ラムの力強い味わいが魅力のカクテル。", "サンフランシスコのケーブルカーにちな\nんで名付けられ、ラムとウイスキーを組み合\nわせたカクテル。", "クラシックなトロピカルフレーバーのカクテルで、\nラムとベルモットを素晴らしくブレンド。", "イタリアのクラシックなカクテルで、ベ\nルモットが支配的な甘苦い味わい。", "ニューオーリンズのクラシックなカク\nテル、複雑で深みがあります。", "カリブ海伝統のカクテルで、大胆なフ\nレーバーと強い味が特徴。"]
    }
    else if (current_scene == 4)
    {
        list_drink_material = ["ハーブ", "ベリー", "ワイン"]
        drink_menu = ["薬草師のブリュー", "ベリーウッドネクター", "僧侶のリザーブ", "ヴィントナーのベリードラフト", "男爵のブレンド", "ベリージュビリー", "ヴィンテージベルベット", "庭師のブレンド", "薬剤師のエリクサー", "実りの収穫"]
        drink_descrip = ["三種類の上質なハーブで作られたこの\nトニックは、その薬用と回復効果で尊\nばれています。", "熟したベリーとハーブのエッセンスが\n調和した、森林の新鮮さを呼び起こす瑞\n々しいブレンド。", "聖なるハーブと修道院で熟成され\nたワインの豊かさを融合させた、神聖\nなレシピ。", "ベリーのジューシーさと上品な\nワインが融合した、鮮やかなカクテル。", "貴族にふさわしい、ワインの力強さとベ\nリーの香りを持つ高貴なミックス。", "ベリーの純粋な形での祝賀、このドリン\nクは自然な甘さの祭典です。", "選りすぐりのヴィンテージをブレンド\nし、豊かで贅沢な味わいを提供。", "手入れの行き届いた庭園と上質なワイ\nンのエッセンスを捉えた、素朴で心\n地よいブレンド。", "伝統的な薬局方に触発された、\n消化を助ける強力な飲み物。", "収穫の恵みを抱きしめ、熟したベリーの\n豊かな味わいとワインのフィニッシュを\n特徴としたブレンド。"]
    }
    else if (current_scene == 5)
    {
        list_drink_material = ["電解質水", "タンパク質\n濃縮液", "ビタミン\nゼリー"]
        drink_menu = ["エレクトロラ\nイトグロー", "プロテインパルス", "マイクログラビテ\nィオシレーション", "ビタミンクロマテ\nィックス", "エネルギークリ\nスタル", "マルチスペクト\nラムゼリー", "ラジエーション\nシールド", "センサリージェ\nリー", "バイオフィードバ\nックフルイド", "スペースデザート"]
        drink_descrip = ["この飲料は特別な電解質バランスの配方を使用\nしており、光の下で発光し、夜間活動\nの安全性を向上させます。", "ナノテクノロジーを利用して体内でのタンパク質\nの迅速な吸収を可能にし、高強度の宇宙任務\n後の迅速なエネルギー補給に理想\n的です。", "マイクロナノバブルが注入され、無重力環境\nで興味深い振動効果を生み出し、ユニーク\nな飲用体験を提供します。", "pHレベルに基づいて色が変わるビタミンゼリ\nーを含んでおり、宇宙飛行士がビタミ\nン摂取を視覚的に監視できます。", "特殊な結晶形のタンパク質がゆっくりと溶解\nし、エネルギーと栄養を継続的に放出\nするため、長期間のタスクに適して\nいます。", "ゼリーの各色は異なる栄養スペクトラムを表\nしており、宇宙飛行士は必要に応じて\n色を選択し、必要な栄養を直感的に理解\nできます。", "特別な放射線防護成分が含まれており、宇宙\nでの放射線ダメージを減少させるとと\nもに、力を増強します。", "この飲料は宇宙飛行士の体調に応じて甘さと\n質感を自動調整し、エネルギーと栄養\nを最適に補給します。", "バイオフィードバックセンサーが含まれてお\nり、リアルタイムで栄養成分を監視\nおよび調整し、宇宙飛行士の特定のニーズ\nに対応します。", "地球上のデザートに似たデザインと味で、馴\n染みのある味と快適さを提供しながら、\n栄養が豊富です。"]
    }
}

